package day16;

public class StudentMain {

	public static void main(String[] args) {
		
		/* 학생이 과목을 수강신청하는 프로그램
		 * - 학생 클래스
		 * - 학번, 이름, 나이, 전화번호, 주소, 
		 * - 과목 클래스 리스트(신청하면 추가)
		 *
		 * - 과목 클래스
		 * - 과목코드, 과목명, 학점, 시수, 교수명, 
		 *    시간표, 강의장, 
		 * - 점수(마지막에 추가)
		 *
		 * - 학생 => 과목 수강하는 과정을 관리
		 * 	 controller 클래스
		 *
		 * - main
		 * - 학생등록 | 학생리스트출력 | 학생검색(학생정보)
		 * - 학생정보수정 | 학생삭제
		 * - 수강신청 | 수강철회
		 * - 과목별 신청자리스트 (학생정보)
		 * - 학생별 성적표 출력 (학생의 수강정보+성적) => 성적평균
		 * - 종료
		 * 
		 * */
	}

}
